package board;

import java.util.Arrays;
import java.util.HashMap;

import board.Pieces.MetaPieceSet;
import ui.Assert;




public enum Formation {
	HEEH(	"車馬象士+士象馬車,"+
			"++++漢++++,"+
			"+砲+++++砲+,"+
			"兵+兵+兵+兵+兵,"+	
			"+++++++++,"+
			"兵+兵+兵+兵+兵,"+
			"+砲+++++砲+,"+
			"++++漢++++,"+
			"車馬象士+士象馬車", 
			
			"111111111,"+
			"111111111,"+
			"111111111,"+
			"111111111,"+	
			"+++++++++,"+
			"000000000,"+
			"000000000,"+
			"000000000,"+
			"000000000"),
	
	EHHE(	"車馬象士+士象馬車,"+
			"++++漢++++,"+
			"+砲+++++砲+,"+
			"兵+兵+兵+兵+兵,"+	
			"+++++++++,"+
			"兵+兵+兵+兵+兵,"+
			"+砲+++++砲+,"+
			"++++漢++++,"+
			"車象馬士+士馬象車", 
			
			"111111111,"+
			"111111111,"+
			"111111111,"+
			"111111111,"+	
			"+++++++++,"+
			"000000000,"+
			"000000000,"+
			"000000000,"+
			"000000000"),
	
	HEEH_ROTATED(
			"車++兵+兵++車,"+
			"馬+砲+++砲+馬,"+
			"象++兵+兵++象,"+
			"士+++++++士,"+
			"+漢+兵+兵+漢+,"+
			"士+++++++士,"+
			"象++兵+兵++象,"+
			"馬+砲+++砲+馬,"+
			"車++兵+兵++車",
			
			
			"1111+0000,"+
			"1111+0000,"+
			"1111+0000,"+
			"1111+0000,"+	
			"1111+0000,"+
			"1111+0000,"+
			"1111+0000,"+
			"1111+0000,"+
			"1111+0000,"),
	
	
	
	
			D(	
					
					"車馬象士漢士象馬車,"+
					"+++++++++,"+
					"+砲+++++砲+,"+
					"兵+兵+兵+兵+兵,"+
					"+++++++++,"+
					"+++++++++,"+
					"兵+兵+兵+兵+兵,"+
					"+砲+++++砲+,"+
					"+++++++++,"+
					"車馬象士漢士象馬車", 
					
					"111111111,"+
					"1111i1111,"+
					"111111111,"+
					"111111111,"+
					"+++++++++,"+
					"+++++++++,"+
					"000000000,"+
					"000000000,"+
					"0000x0000,"+
					"000000000");
	
			
//	
////			"車++兵+兵++車,"+
////			"馬+砲+++砲+馬,"+
////			"象++兵+兵++象,"+
////			"士+++++++士,"+
////			"+漢+兵+兵+漢+,"+
////			"士+++++++士,"+
////			"象++兵+兵++象,"+
////			"馬+砲+++砲+馬,"+
////			"車++兵+兵++車",
//				
//
//			"車++車++++++++車++車,"+
//			"++士+馬+馬+馬+馬+士+++,"+
//			"+士漢+++++++++漢士++,"+
//			"車+++兵+兵+兵+兵++++車,"+
//			"+馬+兵++++++++兵+馬+,"+
//			"++++++++++++++++,"+
//			"+馬+兵++++++++兵+馬+,"+	
//			"++++++++++++++++,"+
//			"+馬+兵++++++++兵+馬+,"+
//			"++++++++++++++++,"+
//			"+馬+兵+++++++兵+馬+,"+
//			"車+++兵+兵+兵+兵++++車,"+
//			"+士漢+++++++++漢士+,"+
//			"++士+馬+馬+馬+馬+士++,"+
//			"車++車+++++++車++車,",
//
//			
//			
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"+++++++++++++,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"
			
//			"1111111+0000000,"+
//			"1111111+0000000,"+ 
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+
//			"1111111+0000000,"+	
//			"+++++++++++++,"+
//			"2222222+3333333,"+
//			"2222222+3333333,"+
//			"2222222+3333333,"+
//			"2222222+3333333,"+
//			"2222222+3333333,"+
//			"2222222+3333333,"+
//			"2222222+3333333,");
	
	private HashMap<Coord, MetaPieceSet> meta = new HashMap<>(); 
	public final int W;
	public final int H;
	
	private Formation(String forma, String teamSet){
		int[] rows_size = dimensionOf(forma.split(","));
		int[] team_rows_size = dimensionOf(teamSet.split(","));
		
		System.out.println(Arrays.toString(rows_size));
		System.out.println(Arrays.toString(team_rows_size));
	
		Assert.throwIF(!Arrays.equals(rows_size, team_rows_size), "The Dimension of a Formation and its Team Set Must Be Equivalent.");
		W = rows_size[0];
		H = rows_size[1];	
		
		init(forma, teamSet);
	}
	
	private int[] dimensionOf(String[] lines){
		int H = lines.length;
		int minW = lines[0].length();
		for(String line: lines){
			if(line!=null && line.length()<minW) minW = line.length();
		}
		int [] dimension = {minW, H};
		return dimension;
	}
	
	public HashMap<Coord, MetaPieceSet> meta(){
		return meta;
	}
	
	private void init(String forma, String teamSet){
		String[]rows = forma.split(",");
		String[]team_rows = teamSet.split(",");
		
		for(int y=0; y<H; y++){
			for(int x=0; x<W; x++){				
				String symbol = ""+rows[y].charAt(x);
				if(symbol.equals("+")) continue;				
				
				int team = 0;
				String teamD = ""+team_rows[y].charAt(x);

				
					team = Integer.parseInt(teamD);
				
									
				
				
				meta.put(new Coord(x,y), new MetaPieceSet(symbol, team));
			}
		}
	}
}
